2022-2/slides/03-operadores.org



#+title: Operadores



#+author: Luigi D. C. Soares
#+email: <luigi.domenico@dcc.ufmg.br>

#+subtitle: Progamação e Desenvolvimento de Software I

#+date: DCC/UFMG (06/09/2022)

#+startup: beamer
#+options: H:1 num:t toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t
#+options: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+latex_class: beamer
#+latex_class_options: [t, aspectratio=169]
#+latex_header: \usepackage{tikz}
#+latex_header: \usetikzlibrary{calc, tikzmark}
#+latex_header: \usepackage{booktabs}
#+beamer_header: \title[Operadores]{Operadores}
#+beamer_header: \subtitle{Programação e Desenvolvimento de Software I}
#+beamer_header: \author[\tiny\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br]{%
#+beamer_header: Gleison S. D. Mendonça, Luigi D. C. Soares\texorpdfstring{\\}{}
#+beamer_header: \texttt{\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br}}
#+beamer_header: \institute[DCC/UFMG]{}
#+beamer_header: \date[06/09/2022]{}
#+beamer_header: %\usetheme{saori}
#+beamer_header: %\usemintedstyle{native}
#+beamer_header: \usetheme{ufmg}

* Operadores

- O que é/para que serve um operador?

* Operadores

- O que é/para que serve um operador?
- Qual a diferença entre um operador *aritmético* e um operador *relacional*?

* Operadores

- O que é/para que serve um operador?
- Qual a diferença entre um operador *aritmético* e um operador *relacional*?
- E o que é um operador *unário*?

* Operadores

- O que é/para que serve um operador?
- Qual a diferença entre um operador *aritmético* e um operador *relacional*?
- E o que é um operador *unário*?
- E um operador *binário*?

* Operadores

- O que é/para que serve um operador?
- Qual a diferença entre um operador *aritmético* e um operador *relacional*?
- E o que é um operador *unário*?
- E um operador *binário*?
- E um operador *bit a bit*?

* Operadores Aritméticos - Binários

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // +: Adição de dois números
    printf("x + y = %d\n", x + y);
    // -: Subtração de dois números
    printf("x - y = %d\n", x - y);
    return 0;
}
#+end_src

#+RESULTS:
: x + y = 13
: x - y = 7

* Operadores Aritméticos - Binários

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // *: Multiplicação de dois números
    printf("x * y = %d\n", x * y);
    // /: Divisão (quociente) de dois números
    printf("x / y = %d\n", x / y);
    return 0;
}
#+end_src

#+RESULTS:
: x * y = 30
: x / y = 3


* Operadores Aritméticos - Binários

- Por que o resultado de =x / y= foi 3? Não deveria ser 3.333...?

* Operadores Aritméticos - Binários

- Por que o resultado de =x / y= foi 3? Não deveria ser 3.333...?
- Hm... a formatação no comando de saída: =%d= vs =%f=

* Operadores Aritméticos - Binários

- Por que o resultado de =x / y= foi 3? Não deveria ser 3.333...?
- Hm... a formatação no comando de saída: =%d= vs =%f=

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // /: Divisão (quociente) de dois números
    printf("x / y = %f\n", x / y);
    return 0;
}
#+end_src

#+RESULTS:
: x / y = 0.000000

* Operadores Aritméticos - Binários

- Por que o resultado de =x / y= foi 3? Não deveria ser 3.333...?
- Hm... a formatação no comando de saída: =%d= vs =%f=
- Agora o resultado foi 0???

* Operadores Aritméticos - Binários

- Por que o resultado de =x / y= foi 3? Não deveria ser 3.333...?
- Hm... a formatação no comando de saída: =%d= vs =%f=
- Agora o resultado foi 0??? A operação foi realizada com dois *inteiros!*

* Operadores Aritméticos - Binários

- Por que o resultado de =x / y= foi 3? Não deveria ser 3.333...?
- Hm... a formatação no comando de saída: =%d= vs =%f=
- Agora o resultado foi 0??? A operação foi realizada com dois *inteiros!*

\vspace{-0.25cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // /: Divisão (quociente) de dois números
    printf("x / y = %f\n", (float) x / y);
    return 0;
}
#+end_src

#+RESULTS:
: x / y = 3.333333

* Operadores Aritméticos - Binários

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // /: Divisão (quociente) de dois números
    printf("x / y = %f\n", (float) x / y);
    // %: Módulo (resto da divisão) de dois números
    printf("x %% y = %d\n", x % y);
    return 0;
}
#+end_src

* Operadores Aritméticos - Unários

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // +: mais unário ou positivo
    printf("+x = %d\n", +x);
    // -: menos unário ou negação
    printf("-x = %d\n", -x);
    return 0;
}
#+end_src

#+RESULTS:
: -x = -10
: +y = -10

* Operadores Aritméticos - Unários

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // ++: pré ou pós incremento
    printf("++x = %d\n", ++x);
    printf("x++ = %d\n", x++);
    printf("x = %d\n", x);
    return 0;
}
#+end_src

#+RESULTS:
: ++x = 11
: x++ = 11
: x = 12

* Operadores Aritméticos - Unários

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // ++: pré ou pós decremento
    printf("--x = %d\n", --x);
    printf("x-- = %d\n", x--);
    printf("x = %d\n", x);
    return 0;
}
#+end_src

#+RESULTS:
: --x = 9
: x-- = 9
: x = 8

* Operadores Aritméticos - Unários

Diferença entre pré e pós incremento/decremento
- =y = x++=: incrementa depois de atribuir
- =y = ++x=: incrementa antes de atribuir

* Expressões

- Expressões são combinações de variáveis, constantes, literais e operadores
- Exemplos:
  - =anos = dias / 365.25;=
  - =i = i + 3;=
  - =c = a * b + d / e;=
  - =c = a * (b + d) / e;=

* Exercício 1

Escreva um programa que solicita ao usuário um inteiro de três
algarismos e imprima na tela o seu valor invertido.

\vspace{0.5cm}
*Exemplo*
#+begin_example
Entrada: 123
Valor invertido: 321
#+end_example

