2022-2/slides/03-operadores.tex
% Created 2022-09-05 seg 14:43
% Intended LaTeX compiler: pdflatex
\documentclass[t, aspectratio=169]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\usepackage{tikz}
\usetikzlibrary{calc, tikzmark}
\usepackage{booktabs}
\usetheme{default}
\author{Luigi D. C. Soares}
\date{DCC/UFMG (06/09/2022)}
\title{Operadores}
\subtitle{Progamação e Desenvolvimento de Software I}
\title[Operadores]{Operadores}
\subtitle{Programação e Desenvolvimento de Software I}
\author[\tiny\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br]{%
Gleison S. D. Mendonça, Luigi D. C. Soares\texorpdfstring{\\}{}
\texttt{\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br}}
\institute[DCC/UFMG]{}
\date[06/09/2022]{}
%\usetheme{saori}
%\usemintedstyle{native}
\usetheme{ufmg}
\hypersetup{
 pdfauthor={Luigi D. C. Soares},
 pdftitle={Operadores},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:orgb35d814}]{Operadores}
\begin{itemize}
\item O que é/para que serve um operador?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org6c42abf}]{Operadores}
\begin{itemize}
\item O que é/para que serve um operador?
\item Qual a diferença entre um operador \alert{aritmético} e um operador \alert{relacional}?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org5593e40}]{Operadores}
\begin{itemize}
\item O que é/para que serve um operador?
\item Qual a diferença entre um operador \alert{aritmético} e um operador \alert{relacional}?
\item E o que é um operador \alert{unário}?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org76719ca}]{Operadores}
\begin{itemize}
\item O que é/para que serve um operador?
\item Qual a diferença entre um operador \alert{aritmético} e um operador \alert{relacional}?
\item E o que é um operador \alert{unário}?
\item E um operador \alert{binário}?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org1af1204}]{Operadores}
\begin{itemize}
\item O que é/para que serve um operador?
\item Qual a diferença entre um operador \alert{aritmético} e um operador \alert{relacional}?
\item E o que é um operador \alert{unário}?
\item E um operador \alert{binário}?
\item E um operador \alert{bit a bit}?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org539d090},fragile]{Operadores Aritméticos - Binários}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // +: Adição de dois números
    printf("x + y = %d\n", x + y);
    // -: Subtração de dois números
    printf("x - y = %d\n", x - y);
    return 0;
}
\end{minted}

\begin{verbatim}
x + y = 13
x - y = 7
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org485cf27},fragile]{Operadores Aritméticos - Binários}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // *: Multiplicação de dois números
    printf("x * y = %d\n", x * y);
    // /: Divisão (quociente) de dois números
    printf("x / y = %d\n", x / y);
    return 0;
}
\end{minted}

\begin{verbatim}
x * y = 30
x / y = 3
\end{verbatim}
\end{frame}


\begin{frame}[label={sec:org7b8123d},fragile]{Operadores Aritméticos - Binários}
 \begin{itemize}
\item Por que o resultado de \texttt{x / y} foi 3? Não deveria ser 3.333\ldots{}?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org10d8e88},fragile]{Operadores Aritméticos - Binários}
 \begin{itemize}
\item Por que o resultado de \texttt{x / y} foi 3? Não deveria ser 3.333\ldots{}?
\item Hm\ldots{} a formatação no comando de saída: \texttt{\%d} vs \texttt{\%f}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf43269c},fragile]{Operadores Aritméticos - Binários}
 \begin{itemize}
\item Por que o resultado de \texttt{x / y} foi 3? Não deveria ser 3.333\ldots{}?
\item Hm\ldots{} a formatação no comando de saída: \texttt{\%d} vs \texttt{\%f}
\end{itemize}

\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // /: Divisão (quociente) de dois números
    printf("x / y = %f\n", x / y);
    return 0;
}
\end{minted}

\begin{verbatim}
x / y = 0.000000
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org354f032},fragile]{Operadores Aritméticos - Binários}
 \begin{itemize}
\item Por que o resultado de \texttt{x / y} foi 3? Não deveria ser 3.333\ldots{}?
\item Hm\ldots{} a formatação no comando de saída: \texttt{\%d} vs \texttt{\%f}
\item Agora o resultado foi 0???
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orge54773b},fragile]{Operadores Aritméticos - Binários}
 \begin{itemize}
\item Por que o resultado de \texttt{x / y} foi 3? Não deveria ser 3.333\ldots{}?
\item Hm\ldots{} a formatação no comando de saída: \texttt{\%d} vs \texttt{\%f}
\item Agora o resultado foi 0??? A operação foi realizada com dois \alert{inteiros!}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf51f90c},fragile]{Operadores Aritméticos - Binários}
 \begin{itemize}
\item Por que o resultado de \texttt{x / y} foi 3? Não deveria ser 3.333\ldots{}?
\item Hm\ldots{} a formatação no comando de saída: \texttt{\%d} vs \texttt{\%f}
\item Agora o resultado foi 0??? A operação foi realizada com dois \alert{inteiros!}
\end{itemize}

\vspace{-0.25cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // /: Divisão (quociente) de dois números
    printf("x / y = %f\n", (float) x / y);
    return 0;
}
\end{minted}

\begin{verbatim}
x / y = 3.333333
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org64bba93},fragile]{Operadores Aritméticos - Binários}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    int y = 3;
    // /: Divisão (quociente) de dois números
    printf("x / y = %f\n", (float) x / y);
    // %: Módulo (resto da divisão) de dois números
    printf("x %% y = %d\n", x % y);
    return 0;
}
\end{minted}

\begin{verbatim}
x / y = 3.333333
x % y = 1
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org57abf8f},fragile]{Operadores Aritméticos - Unários}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // +: mais unário ou positivo
    printf("+x = %d\n", +x);
    // -: menos unário ou negação
    printf("-x = %d\n", -x);
    return 0;
}
\end{minted}

\begin{verbatim}
+x = 10
-x = -10
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org35509df},fragile]{Operadores Aritméticos - Unários}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // ++: pré ou pós incremento
    printf("++x = %d\n", ++x);
    printf("x++ = %d\n", x++);
    printf("x = %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
++x = 11
x++ = 11
x = 12
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org6f76921},fragile]{Operadores Aritméticos - Unários}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // ++: pré ou pós decremento
    printf("--x = %d\n", --x);
    printf("x-- = %d\n", x--);
    printf("x = %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
--x = 9
x-- = 9
x = 8
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org089e073},fragile]{Operadores Aritméticos - Unários}
 Diferença entre pré e pós incremento/decremento
\begin{itemize}
\item \texttt{y = x++}: incrementa depois de atribuir
\item \texttt{y = ++x}: incrementa antes de atribuir
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org0e8aa0c},fragile]{Expressões}
 \begin{itemize}
\item Expressões são combinações de variáveis, constantes, literais e operadores
\item Exemplos:
\begin{itemize}
\item \texttt{anos = dias / 365.25;}
\item \texttt{i = i + 3;}
\item \texttt{c = a * b + d / e;}
\item \texttt{c = a * (b + d) / e;}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org42e6128},fragile]{Exercício 1}
 Escreva um programa que solicita ao usuário um inteiro de três
algarismos e imprima na tela o seu valor invertido.

\vspace{0.5cm}
\alert{Exemplo}
\begin{verbatim}
Entrada: 123
Valor invertido: 321
\end{verbatim}
\end{frame}
