2022-2/slides/03-operadores.org
* Exercício 1 - Solução

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output :cmdline <<< "123"
#include <stdio.h>
int main(int argc, char *argv[]) {
    int numero;
    scanf("%d", &numero);

    int unidade = numero % 10;
    int dezena = (numero / 10) % 10;
    int centena = numero / 100;

    int invertido = 100 * unidade + 10 * dezena + centena;
    printf("valor invertido: %d\n", invertido);
    return 0;
}
#+end_src

#+RESULTS:
: valor invertido: 321

* Conversão de Tipos (Cast)

- Força o resultado da expressão a ser de um tipo especificado
- =(tipo) expressão=
  - =(float) x=
  - =(int) x * 5.25=

* Conversão de Tipos (Cast)

- Força o resultado da expressão a ser de um tipo especificado
- =(tipo) expressão=
  - =(float) x=
  - =(int) x * 5.25=

\vspace{-0.25cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    float f = x / 7;
    printf("%f\n", f);
    return 0;
}
#+end_src

#+RESULTS:
: 1.000000
: 1.428571

* Conversão de Tipos (Cast)

- Força o resultado da expressão a ser de um tipo especificado
- =(tipo) expressão=
  - =(float) x=
  - =(int) x * 5.25=

\vspace{-0.25cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    float f = (float) x / 7;
    printf("%f\n", f);
    return 0;
}
#+end_src

#+RESULTS:
: 1.428571

* Conversão de Tipos (Cast)

- Força o resultado da expressão a ser de um tipo especificado
- =(tipo) expressão=
  - =(float) x=
  - =(int) x * 5.25=
- O nível de prioridade (precedência) da conversão é maior que da divisão

* Operadores Bit-a-Bit

- Operações bit-a-bit ajudam programadores que queiram trabalhar com o
  computador em "baixo nível"
- Essas operações só podem ser usadas nos tipos char, short, int e long
- O número é representado por sua forma binária e as operações são
  feitas em cada bit dele

* Operadores Bit-a-Bit

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    char x = 10;
    char y = 3;
    // &: "E" ("And") bit-a-bit
    printf("x & y = %d\n", x & y);
    // |: "Ou" ("Or") bit-a-bit
    printf("x | y = %d\n", x | y);
    return 0;
}
#+end_src

#+RESULTS:
: x & y = 2
: x | y = 11

* Operadores Bit-a-Bit - & (E)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
|   | 0000 101\bfseries\color{highlight}0 |
| & | 0000 001\bfseries\color{highlight}1 |
|---+-------------------------------------|
|   | 0000 001\bfseries\color{highlight}0 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- *\color{highlight}0 & 0 = 0*
- 0 & 1 = 0 (o mesmo para 1 & 0)
- 1 & 1 = 1

* Operadores Bit-a-Bit - & (E)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
|   | 0000 10@@latex:{\bfseries\color{highlight}1}@@0 |
| & | 0000 00@@latex:{\bfseries\color{highlight}1}@@1 |
|---+-------------------------------------------------|
|   | 0000 00@@latex:{\bfseries\color{highlight}1}@@0 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- 0 & 0 = 0
- 0 & 1 = 0 (o mesmo para 1 & 0)
- *\color{highlight}1 & 1 = 1*

* Operadores Bit-a-Bit - & (E)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
|   | 0000 1@@latex:{\bfseries\color{highlight}0}@@10 |
| & | 0000 0@@latex:{\bfseries\color{highlight}0}@@11 |
|---+-------------------------------------------------|
|   | 0000 0@@latex:{\bfseries\color{highlight}0}@@10 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- *\color{highlight}0 & 0 = 0*
- 0 & 1 = 0 (o mesmo para 1 & 0)
- 1 & 1 = 1

* Operadores Bit-a-Bit - & (E)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
|   | 0000 @@latex:{\bfseries\color{highlight}1}@@010 |
| & | 0000 @@latex:{\bfseries\color{highlight}0}@@011 |
|---+-------------------------------------------------|
|   | 0000 @@latex:{\bfseries\color{highlight}0}@@010 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- 0 & 0 = 0
- *\color{highlight}0 & 1 = 0 (o mesmo para 1 & 0)*
- 1 & 1 = 1

* Operadores Bit-a-Bit - | (Ou)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
|          | 0000 1010 |
| \(\mid\) | 0000 0011 |
|----------+-----------|
|          | 0000 1011 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- 0 | 0 = 0
- 0 | 1 = 1 (o mesmo para 1 | 0)
- 1 | 1 = 1

* Operadores Bit-a-Bit

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    char x = 10;
    char y = 3;
    // ^: "Ou exclusivo" ("Exclusive Or, xor") bit-a-bit
    printf("x ^ y = %d\n", x ^ y);
    // ~: Complemento bit-a-bit
    printf("~x = %d\n", ~x);
    return 0;
}
#+end_src

#+RESULTS:
: x ^ y = 9
: ~x = -11

* Operadores Bit-a-Bit - \land (Ou exclusivo)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
|       | 0000 1010 |
| \land | 0000 0011 |
|-------+-----------|
|       | 0000 1001 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- 0 \land 0 = 0
- 0 \land 1 = 1 (o mesmo para 1 \land 0)
- 1 \land 1 = 0

* Operadores Bit-a-Bit - \sim (Complemento)

** Operação :B_column:
:properties:
:beamer_col: 0.5
:end:

#+attr_latex: :align cc
| \sim | 0000 1010 |
|------+-----------|
|      | 1111 0101 |

** Tabela verdade :B_column:
:properties:
:beamer_col: 0.5
:end:

- \sim{}0 = 1
- \sim{}1 = 0

* Operadores Bit-a-Bit

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    char x = 10;
    char y = 3;
    // <<: Deslocamento a esquerda
    printf("x << y = %d\n", x << y);
    // >>: Deslocamento a direita
    printf("x >> y = %d\n", x >> y);
    return 0;
}
#+end_src

#+RESULTS:
: x << y = 80
: x >> y = 1

* Operadores Bit-a-Bit - Deslocamento

- 0000 1010 \(<<\) 3 = 0101 0000
- 0000 1010 \(>>\) 3 = 0000 0001

* Operadores Simplificados

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // +=: soma e atribui, equivalente a x = x + 3
    x += 3;
    printf("x += 3: %d\n", x);
    // -=: subtrai e atribui, equivalente a x = x - 2
    x -= 2;
    printf("x -= 2: %d\n", x);
    return 0;
}
#+end_src

* Operadores Simplificados

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // *=: multiplica e atribui, equivalente a x = x * 3
    x *= 3;
    printf("x *= 3: %d\n", x);
    // /=: divide e atribui quociente, equivalente a x = x / 2
    x /= 2;
    printf("x /= 2: %d\n", x);
    return 0;
}
#+end_src

