2022-2/slides/03-operadores.tex

\begin{frame}[label={sec:org79aa5d0},fragile]{Exercício 1 - Solução}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int numero;
    scanf("%d", &numero);

    int unidade = numero % 10;
    int dezena = (numero / 10) % 10;
    int centena = numero / 100;

    int invertido = 100 * unidade + 10 * dezena + centena;
    printf("valor invertido: %d\n", invertido);
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:orgdbb734c},fragile]{Conversão de Tipos (Cast)}
 \begin{itemize}
\item Força o resultado da expressão a ser de um tipo especificado
\item \texttt{(tipo) expressão}
\begin{itemize}
\item \texttt{(float) x}
\item \texttt{(int) x * 5.25}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb953ce2},fragile]{Conversão de Tipos (Cast)}
 \begin{itemize}
\item Força o resultado da expressão a ser de um tipo especificado
\item \texttt{(tipo) expressão}
\begin{itemize}
\item \texttt{(float) x}
\item \texttt{(int) x * 5.25}
\end{itemize}
\end{itemize}

\vspace{-0.25cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    float f = x / 7;
    printf("%f\n", f);
    return 0;
}
\end{minted}

\begin{verbatim}
1.0
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org2662217},fragile]{Conversão de Tipos (Cast)}
 \begin{itemize}
\item Força o resultado da expressão a ser de um tipo especificado
\item \texttt{(tipo) expressão}
\begin{itemize}
\item \texttt{(float) x}
\item \texttt{(int) x * 5.25}
\end{itemize}
\end{itemize}

\vspace{-0.25cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    float f = (float) x / 7;
    printf("%f\n", f);
    return 0;
}
\end{minted}

\begin{verbatim}
1.428571
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org1d94ea9},fragile]{Conversão de Tipos (Cast)}
 \begin{itemize}
\item Força o resultado da expressão a ser de um tipo especificado
\item \texttt{(tipo) expressão}
\begin{itemize}
\item \texttt{(float) x}
\item \texttt{(int) x * 5.25}
\end{itemize}
\item O nível de prioridade (precedência) da conversão é maior que da divisão
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org6eee1aa}]{Operadores Bit-a-Bit}
\begin{itemize}
\item Operações bit-a-bit ajudam programadores que queiram trabalhar com o
computador em ``baixo nível''
\item Essas operações só podem ser usadas nos tipos char, short, int e long
\item O número é representado por sua forma binária e as operações são
feitas em cada bit dele
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb4c59b5},fragile]{Operadores Bit-a-Bit}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    char x = 10;
    char y = 3;
    // &: "E" ("And") bit-a-bit
    printf("x & y = %d\n", x & y);
    // |: "Ou" ("Or") bit-a-bit
    printf("x | y = %d\n", x | y);
    return 0;
}
\end{minted}

\begin{verbatim}
x & y = 2
x | y = 11
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgff876ce}]{Operadores Bit-a-Bit - \& (E)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
 & 0000 101\bfseries\color{highlight}0\\
\& & 0000 001\bfseries\color{highlight}1\\
\hline
 & 0000 001\bfseries\color{highlight}0\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item \alert{\color{highlight}0 \& 0 = 0}
\item 0 \& 1 = 0 (o mesmo para 1 \& 0)
\item 1 \& 1 = 1
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org2089767}]{Operadores Bit-a-Bit - \& (E)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
 & 0000 10{\bfseries\color{highlight}1}0\\
\& & 0000 00{\bfseries\color{highlight}1}1\\
\hline
 & 0000 00{\bfseries\color{highlight}1}0\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item 0 \& 0 = 0
\item 0 \& 1 = 0 (o mesmo para 1 \& 0)
\item \alert{\color{highlight}1 \& 1 = 1}
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org7ea9075}]{Operadores Bit-a-Bit - \& (E)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
 & 0000 1{\bfseries\color{highlight}0}10\\
\& & 0000 0{\bfseries\color{highlight}0}11\\
\hline
 & 0000 0{\bfseries\color{highlight}0}10\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item \alert{\color{highlight}0 \& 0 = 0}
\item 0 \& 1 = 0 (o mesmo para 1 \& 0)
\item 1 \& 1 = 1
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org35849f4}]{Operadores Bit-a-Bit - \& (E)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
 & 0000 {\bfseries\color{highlight}1}010\\
\& & 0000 {\bfseries\color{highlight}0}011\\
\hline
 & 0000 {\bfseries\color{highlight}0}010\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item 0 \& 0 = 0
\item \alert{\color{highlight}0 \& 1 = 0 (o mesmo para 1 \& 0)}
\item 1 \& 1 = 1
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orgeb824a2}]{Operadores Bit-a-Bit - | (Ou)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
 & 0000 1010\\
\(\mid\) & 0000 0011\\
\hline
 & 0000 1011\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item 0 | 0 = 0
\item 0 | 1 = 1 (o mesmo para 1 | 0)
\item 1 | 1 = 1
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org785fd86},fragile]{Operadores Bit-a-Bit}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    char x = 10;
    char y = 3;
    // ^: "Ou exclusivo" ("Exclusive Or, xor") bit-a-bit
    printf("x ^ y = %d\n", x ^ y);
    // ~: Complemento bit-a-bit
    printf("~x = %d\n", ~x);
    return 0;
}
\end{minted}

\begin{verbatim}
x ^ y = 9
~x = -11
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orga9c63da}]{Operadores Bit-a-Bit - \(\land\) (Ou exclusivo)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
 & 0000 1010\\
\(\land\) & 0000 0011\\
\hline
 & 0000 1001\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item 0 \(\land\) 0 = 0
\item 0 \(\land\) 1 = 1 (o mesmo para 1 \(\land\) 0)
\item 1 \(\land\) 1 = 0
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org98a0bb8}]{Operadores Bit-a-Bit - \(\sim\) (Complemento)}
\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{center}
\begin{tabular}{cc}
\(\sim\) & 0000 1010\\
\hline
 & 1111 0101\\
\end{tabular}
\end{center}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{itemize}
\item \(\sim\)0 = 1
\item \(\sim\)1 = 0
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org457b7a7},fragile]{Operadores Bit-a-Bit}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    char x = 10;
    char y = 3;
    // <<: Deslocamento a esquerda
    printf("x << y = %d\n", x << y);
    // >>: Deslocamento a direita
    printf("x >> y = %d\n", x >> y);
    return 0;
}
\end{minted}

\begin{verbatim}
x << y = 80
x >> y = 1
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org239ccf6}]{Operadores Bit-a-Bit - Deslocamento}
\begin{itemize}
\item 0000 1010 \(<<\) 3 = 0101 0000
\item 0000 1010 \(>>\) 3 = 0000 0001
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org23b9016},fragile]{Operadores Simplificados}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // +=: soma e atribui, equivalente a x = x + 3
    x += 3;
    printf("x += 3: %d\n", x);
    // -=: subtrai e atribui, equivalente a x = x - 2
    x -= 2;
    printf("x -= 2: %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
x += 3: 13
x -= 2: 11
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgf461c1d},fragile]{Operadores Simplificados}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // *=: multiplica e atribui, equivalente a x = x * 3
    x *= 3;
    printf("x *= 3: %d\n", x);
    // /=: divide e atribui quociente, equivalente a x = x / 2
    x /= 2;
    printf("x /= 2: %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
x *= 3: 30
x /= 2: 15
\end{verbatim}
\end{frame}
