2022-2/slides/03-operadores.org
* Operadores Simplificados

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // %=: divide e atribui resto, equivalente a x = x % 3
    x %= 3;
    printf("x %= 3: %d\n", x);
    // &=: "E" bit-a-bit e atribui, equivalente a x = x & 2
    x &= 2;
    printf("x &= 2: %d\n", x);
    return 0;
}
#+end_src

* Operadores Simplificados

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // |=: "Ou" bit-a-bit e atribui, equivalente a x = x | 3
    x |= 3;
    printf("x |= 3: %d\n", x);
    // <<=: shift a esquerda e atribui, equivalente a x = x << 2
    x <<= 2;
    printf("x <<= 2: %d\n", x);
    return 0;
}
#+end_src

* Overflow e Underflow

- Quando representamos um valor menor ou maior que o permitido pelo tipo, ocorre
  um erro de cálculo
  - Overflow: valor superior ao permitido
  - Underflow: valor inferior ao permitido

* Underflow - Exemplo

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    short x = -32768;
    printf("Valor antes: %d\n", x);
    x--; // Gerando um underflow
    printf("Valor depois: %d\n", x);
    return 0;
}
#+end_src

#+RESULTS:
: Valor antes: -32768
: Valor depois: 32767

* Overflow - Exemplo

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    short x = 32767;
    printf("Valor antes: %d\n", x);
    x++; // Gerando um overflow
    printf("Valor depois: %d\n", x);
    return 0;
}
#+end_src

#+RESULTS:
: Valor antes: 32767
: Valor depois: -32768

* Overflow e Underflow

- Não dão erro: o programa *continua a execução* na
  *maioria* das linguagens de programação

* Overflow e Underflow

- Não dão erro: o programa *continua a execução* na
  *maioria* das linguagens de programação

- *Moral da história:* procure saber quais são os valores máximos e mínimos que
  seu programa deve suportar, e escolha o tamanho da variável de acordo

* Operadores Relacionais e Lógicos

- Operadores relacionais são utilizados na comparação de valores
- Esse tipo de operador retorna *verdadeiro* ou *falso*

* Operadores Relacionais e Lógicos

- Operadores relacionais são utilizados na comparação de valores
- Esse tipo de operador retorna *verdadeiro* ou *falso*
  - Qual o tipo desses valores?

* Operadores Relacionais e Lógicos

- Operadores relacionais são utilizados na comparação de valores
- Esse tipo de operador retorna *verdadeiro* ou *falso*
  - Qual o tipo desses valores? *lógico* ou *booleano*

* Operadores Relacionais e Lógicos

- Operadores relacionais são utilizados na comparação de valores
- Esse tipo de operador retorna *verdadeiro* ou *falso*
  - Qual o tipo desses valores? *lógico* ou *booleano*
  - Mas C não possui um tipo *bool* por padrão, nem literais "verdadeiro" e "falso"
  - Logo, utilizamos o inteiro *1* para verdadeiro e *0* para falso

* Operadores Relacionais e Lógicos

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // <: menor
    printf("x < 10? %d\n", x < 10);
    // <=: menor ou igual
    printf("x <= 10? %d\n", x <= 10);
    return 0;
}
#+end_src

#+RESULTS:
: x < 10? 0
: x <= 10? 1

* Operadores Relacionais e Lógicos

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // >: maior
    printf("x > 10? %d\n", x > 10);
    // >=: maior ou igual
    printf("x >= 10? %d\n", x >= 10);
    return 0;
}
#+end_src

#+RESULTS:
: x > 10? 0
: x >= 10? 1

* Operadores Relacionais e Lógicos

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // ==: igual
    printf("x == 10? %d\n", x == 10);
    // !=: diferente
    printf("x != 10? %d\n", x != 10);
    return 0;
}
#+end_src

#+RESULTS:
: x == 10? 1
: x != 10? 0

* Operadores Relacionais e Lógicos

- Existe uma biblioteca chamada *stdbool* que fornece o tipo *bool*
  e os valores *true* (verdadeiro) e *false* (falso)
- Podemos utilizá-la para tornar o código mais legível

* Operadores Relacionais e Lógicos

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
#include <stdbool.h>
int main(int argc, char *argv[]) {
    bool verdadeiro = true;
    printf("Verdadeiro: %d\n", verdadeiro);
    bool falso = false;
    printf("Falso: %d\n", falso);
    return 0;
}
#+end_src

#+RESULTS:
: Verdadeiro: 1
: Falso: 0

* Operadores Relacionais e Lógicos

- Operadores lógicos são utilizados para combinar valores
  lógicos (verdadeiro e falso)

* Operadores Relacionais e Lógicos

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    char c = '5';
    // &&: "E" ("And") lógico
    printf("O caractere é um número? %d\n", c >= '0' && c <= '9');
    // ||: "Ou" ("Or") lógico
    printf("O caractere é a letra 'A'? %d\n", c == 'a' || c == 'A');
    return 0;
}
#+end_src

#+RESULTS:
: O caractere é um número? 1
: O caractere é a letra 'A'? 0

* Operadores Relacionais e Lógicos

\vspace{-0.5cm}
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports both :results output
#include <stdio.h>
#include <stdbool.h>
int main(int argc, char *argv[]) {
    char c = '5';
    bool eh_numero = c >= '0' && c <= '9';
    // !: "Não" ("Not", negação)
    printf("O caractere *não* é um número? %d\n", !eh_numero);
    return 0;
}
#+end_src

#+RESULTS:
: O caractere *não* é um número? 0

* Operadores Relacionais e Lógicos

#+attr_latex: :align cccccc :booktabs t
| a | b | !a | !b | a && b | a \(\mid\mid\) b |
|---+---+----+----+--------+------------------|
| F | F | V  | V  | F      | F                |
| F | V | V  | F  | F      | V                |
| V | F | F  | V  | F      | V                |
| V | V | F  | F  | V      | V                |

* Exercício 2

Escreva um programa que solicita ao usuário um inteiro e verifica se
o número informado é par ou ímpar.

\vspace{0.5cm}
*Exemplo*
#+begin_example
Entrada: 10
É ímpar? Não
#+end_example

* Exercício 2 - Solução 1

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output :cmdline <<< "3"
#include <stdio.h>
int main(int argc, char *argv[]) {
    int numero;
    scanf("%d", &numero);
    printf("É ímpar? %d\n", numero % 2 != 0);
    return 0;
}
#+end_src

#+RESULTS:
: É ímpar? 1

