2022-2/slides/03-operadores.tex

\begin{frame}[label={sec:org0dfd175},fragile]{Operadores Simplificados}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // %=: divide e atribui resto, equivalente a x = x % 3
    x %= 3;
    printf("x %= 3: %d\n", x);
    // &=: "E" bit-a-bit e atribui, equivalente a x = x & 2
    x &= 2;
    printf("x &= 2: %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
x %= 3: 1
x &= 2: 0
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org81b72bc},fragile]{Operadores Simplificados}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // |=: "Ou" bit-a-bit e atribui, equivalente a x = x | 3
    x |= 3;
    printf("x |= 3: %d\n", x);
    // <<=: shift a esquerda e atribui, equivalente a x = x << 2
    x <<= 2;
    printf("x <<= 2: %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
x |= 3: 11
x <<= 2: 44
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgf00cb3c}]{Overflow e Underflow}
\begin{itemize}
\item Quando representamos um valor menor ou maior que o permitido pelo tipo, ocorre
um erro de cálculo
\begin{itemize}
\item Overflow: valor superior ao permitido
\item Underflow: valor inferior ao permitido
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgac66284},fragile]{Underflow - Exemplo}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    short x = -32768;
    printf("Valor antes: %d\n", x);
    x--; // Gerando um underflow
    printf("Valor depois: %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
Valor antes: -32768
Valor depois: 32767
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org052383e},fragile]{Overflow - Exemplo}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    short x = 32767;
    printf("Valor antes: %d\n", x);
    x++; // Gerando um overflow
    printf("Valor depois: %d\n", x);
    return 0;
}
\end{minted}

\begin{verbatim}
Valor antes: 32767
Valor depois: -32768
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org6bbc634}]{Overflow e Underflow}
\begin{itemize}
\item Não dão erro: o programa \alert{continua a execução} na
\alert{maioria} das linguagens de programação
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgeab63d1}]{Overflow e Underflow}
\begin{itemize}
\item Não dão erro: o programa \alert{continua a execução} na
\alert{maioria} das linguagens de programação

\item \alert{Moral da história:} procure saber quais são os valores máximos e mínimos que
seu programa deve suportar, e escolha o tamanho da variável de acordo
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb286133}]{Operadores Relacionais e Lógicos}
\begin{itemize}
\item Operadores relacionais são utilizados na comparação de valores
\item Esse tipo de operador retorna \alert{verdadeiro} ou \alert{falso}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org692968d}]{Operadores Relacionais e Lógicos}
\begin{itemize}
\item Operadores relacionais são utilizados na comparação de valores
\item Esse tipo de operador retorna \alert{verdadeiro} ou \alert{falso}
\begin{itemize}
\item Qual o tipo desses valores?
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org054cfe5}]{Operadores Relacionais e Lógicos}
\begin{itemize}
\item Operadores relacionais são utilizados na comparação de valores
\item Esse tipo de operador retorna \alert{verdadeiro} ou \alert{falso}
\begin{itemize}
\item Qual o tipo desses valores? \alert{lógico} ou \alert{booleano}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org1b89c1b}]{Operadores Relacionais e Lógicos}
\begin{itemize}
\item Operadores relacionais são utilizados na comparação de valores
\item Esse tipo de operador retorna \alert{verdadeiro} ou \alert{falso}
\begin{itemize}
\item Qual o tipo desses valores? \alert{lógico} ou \alert{booleano}
\item Mas C não possui um tipo \alert{bool} por padrão, nem literais ``verdadeiro'' e ``falso''
\item Logo, utilizamos o inteiro \alert{1} para verdadeiro e \alert{0} para falso
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org990a80e},fragile]{Operadores Relacionais e Lógicos}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // <: menor
    printf("x < 10? %d\n", x < 10);
    // <=: menor ou igual
    printf("x <= 10? %d\n", x <= 10);
    return 0;
}
\end{minted}

\begin{verbatim}
x < 10? 0
x <= 10? 1
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org0d13d02},fragile]{Operadores Relacionais e Lógicos}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // >: maior
    printf("x > 10? %d\n", x > 10);
    // >=: maior ou igual
    printf("x >= 10? %d\n", x >= 10);
    return 0;
}
\end{minted}

\begin{verbatim}
x > 10? 0
x >= 10? 1
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orge84941f},fragile]{Operadores Relacionais e Lógicos}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x = 10;
    // ==: igual
    printf("x == 10? %d\n", x == 10);
    // !=: diferente
    printf("x != 10? %d\n", x != 10);
    return 0;
}
\end{minted}

\begin{verbatim}
x == 10? 1
x != 10? 0
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org27c3ee8}]{Operadores Relacionais e Lógicos}
\begin{itemize}
\item Existe uma biblioteca chamada \alert{stdbool} que fornece o tipo \alert{bool}
e os valores \alert{true} (verdadeiro) e \alert{false} (falso)
\item Podemos utilizá-la para tornar o código mais legível
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org7f4af16},fragile]{Operadores Relacionais e Lógicos}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
#include <stdbool.h>
int main(int argc, char *argv[]) {
    bool verdadeiro = true;
    printf("Verdadeiro: %d\n", verdadeiro);
    bool falso = false;
    printf("Falso: %d\n", falso);
    return 0;
}
\end{minted}

\begin{verbatim}
Verdadeiro: 1
Falso: 0
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgfcac18d}]{Operadores Relacionais e Lógicos}
\begin{itemize}
\item Operadores lógicos são utilizados para combinar valores
lógicos (verdadeiro e falso)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgfb18d98},fragile]{Operadores Relacionais e Lógicos}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    char c = '5';
    // &&: "E" ("And") lógico
    printf("O caractere é um número? %d\n", c >= '0' && c <= '9');
    // ||: "Ou" ("Or") lógico
    printf("O caractere é a letra 'A'? %d\n", c == 'a' || c == 'A');
    return 0;
}
\end{minted}

\begin{verbatim}
O caractere é um número? 1
O caractere é a letra 'A'? 0
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org43eafdd},fragile]{Operadores Relacionais e Lógicos}
 \vspace{-0.5cm}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
#include <stdbool.h>
int main(int argc, char *argv[]) {
    char c = '5';
    bool eh_numero = c >= '0' && c <= '9';
    // !: "Não" ("Not", negação)
    printf("O caractere *não* é um número? %d\n", !eh_numero);
    return 0;
}
\end{minted}

\begin{verbatim}
O caractere *não* é um número? 0
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgd80e2fa}]{Operadores Relacionais e Lógicos}
\begin{center}
\begin{tabular}{cccccc}
\toprule
a & b & !a & !b & a \&\& b & a \(\mid\mid\) b\\
\midrule
F & F & V & V & F & F\\
F & V & V & F & F & V\\
V & F & F & V & F & V\\
V & V & F & F & V & V\\
\bottomrule
\end{tabular}
\end{center}
\end{frame}

\begin{frame}[label={sec:org26fc374},fragile]{Exercício 2}
 Escreva um programa que solicita ao usuário um inteiro e verifica se
o número informado é par ou ímpar.

\vspace{0.5cm}
\alert{Exemplo}
\begin{verbatim}
Entrada: 10
É ímpar? Não
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org2e50fc2},fragile]{Exercício 2 - Solução 1}
 \begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int numero;
    scanf("%d", &numero);
    printf("É ímpar? %d\n", numero % 2 != 0);
    return 0;
}
\end{minted}
\end{frame}
