2022-2/slides/03-operadores.org
* Exercício 2 - Solução 2

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output :cmdline <<< "3"
#include <stdio.h>
int main(int argc, char *argv[]) {
    int numero;
    scanf("%d", &numero);
    printf("É ímpar? %d\n", numero & 1);
    return 0;
}
#+end_src

#+RESULTS:
: É ímpar? 1
