2022-2/slides/03-operadores.tex

\begin{frame}[label={sec:org80a6165},fragile]{Exercício 2 - Solução 2}
 \begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int numero;
    scanf("%d", &numero);
    printf("É ímpar? %d\n", numero & 1);
    return 0;
}
\end{minted}
\end{frame}
\end{document}
